/**
 * Структура программы
 * */

package ipr.chp1

/**
 * Функция main точка входа в программу
 * @param args до версии kotlin 1.3 обязательный
 * */
fun main(args: Array<String>) {
    //инструкция (statement)
    println("Hello Kotlin") // ';' после инструкции не обязательна если в строке 1 инструкция

    // ';' обязательно если в строке больше 1 инструкции
    print("Если ");print("в 1 строке больше ");print("1 инструкции");
}

/*
* многострочный
* комментарий
* */

// однострочный комментарий